"**Comparison of Foreign Policy and International Relations Policies**\n\n| **Policy Area** | **Ranil Wickremesinghe** | **Sajith Premadasa** |\n| --- | --- | --- |\n| Strengthening Institutions | Strengthening of institutions and recovery of stolen assets | No data available |\n| Collaboration with International Partners | Collaboration with international partners to support economic recovery and development | Multilateral approach, embracing a world order governed by the rule of law and international norms |\n| Economic Diplomacy | No data available | Focusing on investment, trade, and tourism, with a dedicated government unit for trade negotiations |\n| National Security | No data available | Strengthening national security through defense cooperation based on a farsighted and strong foreign policy |\n| Non-Aligned Foreign Policy | No data available | Being friends with all and enemies with none |\n| Core Principles | No data available | Non-use of force, peaceful resolution of conflict, and adherence to human rights |\n| Tourism Development | No data available | Implementing the \"Tourism Policy for Sri Lanka: A Blueprint for Sustainable and Inclusive Growth\" |\n| National Security Council | No data available | Establishing a National Security Council by a new law, assigning it necessary powers |\n| International Engagement | Engaging with the international community, including the IMF, to support economic recovery and development | No data available |\n\n**Common Policies**\n\n* Both candidates emphasize the importance of engaging with the international community to support Sri Lanka's economic recovery and development.\n\n**Unique or Innovative Policies**\n\n* Ranil Wickremesinghe: Emphasis on collaboration with international partners and strengthening of institutions to ensure a system where opportunities are accessible to all.\n* Sajith Premadasa: Establishing a dedicated government unit for trade negotiations, implementing a detailed tourism policy, and establishing a National Security Council.\n\n**Analysis**\n\nRanil Wickremesinghe's foreign policy approach focuses on strengthening institutions and collaborating with international partners to support economic recovery and development. His emphasis on engaging with the international community, including the IMF, highlights his commitment to seeking external support for Sri Lanka's economic growth.\n\nSajith Premadasa's foreign policy approach is more comprehensive, with a focus on a multilateral system, non-aligned foreign policy, and core principles of non-use of force and adherence to human rights. His emphasis on economic diplomacy, national security, and tourism development suggests a more proactive approach to engaging with the international community. The establishment of a dedicated government unit for trade negotiations and a National Security Council are innovative policies that set him apart from Ranil Wickremesinghe."