"**Comparison of Policies: Ranil Wickremesinghe and Sajith Premadasa**\n\n| **Policy Area** | **Ranil Wickremesinghe** | **Sajith Premadasa** |\n| --- | --- | --- |\n| **Education Reform and Innovation** | Modernize school infrastructure by 2040, implement teacher training program by 2025, introduce Peoples' Initiative Act | Revamp education sector, prioritize policies for improving educational outcomes, developing job-relevant skills, and fostering innovation |\n|  | Transform schools into vibrant learning hubs by 2027 | Curriculum reform (no specific details) |\n| **Healthcare System and Public Health** | Establish private hospitals in all provinces, introduce healthcare insurance scheme, rebuild Colombo National Hospital | Reinforce healthcare sector with professional and technological resources, transform health sector with high-tech solutions |\n|  | Upgrade government hospitals, construct new ones, reduce low-income people suffering from hazards to 10% in 5 years | Build digital health public infrastructure, incorporate lessons from '1990 Suwa Seriya' ambulance service |\n| **Infrastructure Development and Modernization** | Modernize school infrastructure, upgrade government hospitals, rebuild Colombo National Hospital | Ensure every citizen can access quality housing, develop infrastructure to support healthcare and education sectors |\n|  | No data available (beyond healthcare and education) | No data available (beyond housing, healthcare, and education) |\n\n**Common Policies:**\n\n* Both candidates prioritize education reform and innovation, with a focus on improving educational outcomes and developing job-relevant skills.\n* Both candidates aim to upgrade and modernize healthcare infrastructure, with a focus on increasing efficiency and accessibility.\n\n**Unique or Innovative Policies:**\n\n* Ranil Wickremesinghe:\n\t+ Peoples' Initiative Act, enabling students to directly influence the national agenda.\n\t+ Aswesuma program, providing financial assistance to 2.4 million families.\n\t+ Transforming schools into vibrant learning hubs by 2027.\n* Sajith Premadasa:\n\t+ Building a digital health public infrastructure to increase efficiency in the public sector.\n\t+ Incorporating lessons learned from the '1990 Suwa Seriya' ambulance service to enhance quality and efficiency in the healthcare sector.\n\n**Analysis:**\n\n* Ranil Wickremesinghe's policies focus on modernizing and transforming key sectors, with a emphasis on education and healthcare. His approach is characterized by specific, measurable targets and innovative initiatives.\n* Sajith Premadasa's policies prioritize building a competitive workforce and fostering innovation, with a focus on education and healthcare. His approach is more general, with a emphasis on incorporating technology and lessons learned from past initiatives.\n\nOverall, both candidates recognize the importance of education and healthcare in driving Sri Lanka's development, but their approaches differ in terms of specificity, innovation, and focus."